src/conf/xml-resources/web-service-references/billService/wsdl/ose-test.com/ol-ti-itcpe/billService.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="billService" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:tns="http://tempuri.org/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:i0="http://service.sunat.gob.pe" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"><wsp:Policy wsu:Id="BillServicePort_policy"><wsp:ExactlyOne><wsp:All><sp:TransportBinding xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy"><wsp:Policy><sp:TransportToken><wsp:Policy><sp:HttpsToken RequireClientCertificate="false"/></wsp:Policy></sp:TransportToken><sp:AlgorithmSuite><wsp:Policy><sp:Basic256/></wsp:Policy></sp:AlgorithmSuite><sp:Layout><wsp:Policy><sp:Lax/></wsp:Policy></sp:Layout><sp:IncludeTimestamp/></wsp:Policy></sp:TransportBinding><sp:SignedSupportingTokens xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy"><wsp:Policy><sp:UsernameToken sp:IncludeToken="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy/IncludeToken/AlwaysToRecipient"><wsp:Policy><sp:WssUsernameToken10/></wsp:Policy></sp:UsernameToken></wsp:Policy></sp:SignedSupportingTokens><sp:Wss10 xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy"><wsp:Policy/></sp:Wss10></wsp:All></wsp:ExactlyOne></wsp:Policy><wsdl:import namespace="http://service.sunat.gob.pe" location="https://ose-test.com/ol-ti-itcpe/billService.svc?wsdl=wsdl0"/><wsdl:types/><wsdl:binding name="BillServicePort" type="i0:IbillService"><wsp:PolicyReference URI="#BillServicePort_policy"/><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="sendSummary"><soap:operation soapAction="urn:sendSummary" style="document"/><wsdl:input name="sendSummaryRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="sendSummaryResponse"><soap:body use="literal"/></wsdl:output><wsdl:fault name="message"><soap:fault name="message" use="literal"/></wsdl:fault></wsdl:operation><wsdl:operation name="getStatus"><soap:operation soapAction="urn:getStatus" style="document"/><wsdl:input name="getStatusRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="getStatusResponse"><soap:body use="literal"/></wsdl:output><wsdl:fault name="message"><soap:fault name="message" use="literal"/></wsdl:fault></wsdl:operation><wsdl:operation name="sendPack"><soap:operation soapAction="urn:sendPack" style="document"/><wsdl:input name="sendPackRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="sendPackResponse"><soap:body use="literal"/></wsdl:output><wsdl:fault name="message"><soap:fault name="message" use="literal"/></wsdl:fault></wsdl:operation><wsdl:operation name="getStatusCdr"><soap:operation soapAction="urn:getStatusCdr" style="document"/><wsdl:input name="getStatusCdrRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="getStatusCdrResponse"><soap:body use="literal"/></wsdl:output><wsdl:fault name="message"><soap:fault name="message" use="literal"/></wsdl:fault></wsdl:operation><wsdl:operation name="sendBill"><soap:operation soapAction="urn:sendBill" style="document"/><wsdl:input name="sendBillRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="sendBillResponse"><soap:body use="literal"/></wsdl:output><wsdl:fault name="message"><soap:fault name="message" use="literal"/></wsdl:fault></wsdl:operation></wsdl:binding><wsdl:service name="billService"><wsdl:port name="BillServicePort" binding="tns:BillServicePort"><soap:address location="https://ose-test.com/ol-ti-itcpe/billService.svc"/></wsdl:port></wsdl:service></wsdl:definitions>